app/controllers/testcases_controller.rb

  def index

    @testcases = Testcase.search(params[:s])
---
SELECT * FROM "testcases"

  def create
    @testcase = Testcase.new(params[:testcase])

    respond_to do |format|
      if @testcase.save
---
INSERT INTO "testcases" ("created_at", "title", "updated_at") VALUES('2009-09-01 08:12:02', 'dfsgmy ', '2009-09-01 08:12:02')

  def find_testcase
    @testcase = Testcase.find(params[:id])
---
SELECT * FROM "testcases" WHERE ("testcases"."id" = 1)